#include<iostream>
#include <graphics.h>
using namespace std;

int x1, y1, x2, y2, x3, y3, cv;

int main() {

    initwindow(800, 600);

	x1=50;  y1=100;
	x2=250; y2=100;
	x3=150; y3=30;
	cv=4;					// дава цвят, в случая 4 /червен/
	setcolor(cv);			// задава цвят за рисуване на точките 4 /червен/
	moveto(x1,y1);			// мести до (x1, y1)
	lineto(x2,y2);			// рисува до следващатя точка този и следващите 2 реда
	lineto(x3,y3);
	lineto(x1,y1);
	setfillstyle(1,4);		// ВАЖНО: задава стил на запълване 1 /плътен/ и цвят 4 /червен/
	floodfill((x1+x2)/2, (y1+y3)/2, cv); 	// ПО-ВАЖНО: Отива в средата на триъгълника и
							// задава точката от която ще започне запълването 
							// това е средата: (x1+x2)/2 и (y1+y3)/2.
	// и последното във floodfill е цветът с който ще запълва, 
	// докато СТИГНЕ до цвят cv=4.
	// Последното означава следното:
	// Ако цветът за рисуване на триъгълника е бял /15/
	// тогава последната променлива 4 във floodfill е
	// рисувай с цжят 4 докато стигнеш до точка в червен цвят.
	// Запишете програмата като triangle1.cpp !!!
	// В ред 14 напишете cv=15 /бял цвят за контура/
	// а в ред 21 напишете 
	// floodfill((x1+x2)/2, (y1+y3)/2, 15);
	// Трябва да получите триъгълник с цвят на контура 15
	// а запълването ше е с цвят 4.
	// Повтарям пак:
	// В ред 14 дава цвят на затворения КОНТУР /това са линиите на триъгълника/.
	// В ред 21 задава стилът на запълване, който е 1 /плътен/
	// и следващото е ДА ЗАПЪЛВА докато стигне до цвета КОНТУРА, т.е. от ред 14 !!!
	// След това пак сменете цвета в ред 14 с друг
	// и сменете в floodfill floodfill((x1+x2)/2, (y1+y3)/2, ДРУГ ЦВЯТ от ред 14);
	// Така ше получите един цвят на линията и друг цвят на запълването.
    getch();
    closegraph();
    return 0;
}

